# i = 1 # переменная цикла
# while i <= 10:
# 	print(i)
# 	i += 1
# print("Цикл закончился")
# 1 шаг: проверяем условие - i(=1) меньше 100? 
# если да - то, выводим i, затем i увеличиваем на 1
# 2 шаг: проверяем условие - i(=2) меньше 100?
# если да - то, выводим i, затем i увеличиваем на 1
# 3 шаг: проверяем условие - i(=3) меньше 100?
# если да - то, выводим i, затем i увеличиваем на 1
# 4 шаг: проверяем условие - i(=4) меньше 100?
# если да - то, выводим i, затем i увеличиваем на 1
# 5 шаг: проверяем условие -i (=5) меньше 100?
# если да - то, выводим i, затем i увеличиваем на 1

name = ''
while name != 'Абдулгамид и Тиана':
	name = input('Как зовут Вас и Вашу спутницу?')

print("Добро пожаловать!")

1 итерация: проверяем условие - name не равно 'Абдулгамид и Тиана'?
если да - выполняем команду input и получаем новое значение 
name с консоли.