print("Здравствуй, Амин" + ". Как твои дела?")

print(5) # целый тип - int 

print(5.6) # дробный тип - float

print(int(7.6)) # преобразование float к int

print("I am a string") # строковый тип - str 
print("5") # также строковый тип - str
print('3') # также строковый тип - str

print(True) # логический(булевый) тип - bool

print(None) # пустой тип 

a = 5
b = 10 # a и b - ссылки на целочисленные объекты 5 и 10 
print("Значение переменной:", a + 10)
a = a + b
print("Новое значение переменной:", a)

c = '1'
d = '2'
print(c + d)